ErpTest/src/DataProcessors/пкУстановкаРабочихДатПользователей/пкУстановкаРабочихДатПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>пкУстановкаРабочихДатПользователей</name>
  <comment>Рарус</comment>
</mdclass:DataProcessor>

ErpTest/src/InformationRegisters/пкРабочиеДатыПользователей/пкРабочиеДатыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкРабочиеДатыПользователей</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/DataProcessors/пкУстановкаРабочихДатПользователей/Forms/Форма/Module.bsl
&НаСервере
Процедура УстановитьНаСервере()
    
    МенеджерЗаписи = РегистрыСведений.пкРабочиеДатыПользователей.СоздатьМенеджерЗаписи();
    
    Пользователь = Пользователи.ТекущийПользователь();
    МенеджерЗаписи.Пользователь = Пользователь;
    
    МенеджерЗаписи.Прочитать();
    
    Если Дата <> НачалоДня(ТекущаяДата()) Тогда
        Если МенеджерЗаписи.Выбран() Тогда
            МенеджерЗаписи.Дата = Дата;
        Иначе
            МенеджерЗаписи.Пользователь = Пользователь;
            МенеджерЗаписи.Дата         = Дата;
        КонецЕсли;
        
        МенеджерЗаписи.Записать();
    Иначе
        Если МенеджерЗаписи.Выбран() Тогда
            МенеджерЗаписи.Удалить();    
        КонецЕсли;    
    КонецЕсли;    

КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
    
    УстановитьНаСервере();
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    МенеджерЗаписи = РегистрыСведений.пкРабочиеДатыПользователей.СоздатьМенеджерЗаписи();
    МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
    
    МенеджерЗаписи.Прочитать();
    
    Если МенеджерЗаписи.Выбран() Тогда
        Дата = МенеджерЗаписи.Дата;
    Иначе
        Дата = ТекущаяДата();
    КонецЕсли;    
    
КонецПроцедуры
